AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 HTTP/User/Sources/net.c
#include "stm32f10x.h"
#include "gpio.h"
#include "enc28j60.h"
#include "spi.h"
#include "uart.h"
#include "net.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

extern uint8_t mac_addr[6];
extern uint8_t mac_addr_null[6];
extern uint8_t mac_addr_bc[6];
extern uint8_t ip_addr[4];
extern uint8_t ip_dst[4];
extern enc28_frame frame;
extern uint32_t clk_s; 

uint16_t dst_prt;
arp_record arp_table[ARP_TABLE_LEN];
uint8_t cur_index;
uart_ip ip_dst_str;

tcp_prop tcp_pckt_prop;

const char http_header[] = {"HTTP/1.1 200 OK\r\nServer: nginx\r\nContent-Type: text/html\r\nConnection: keep-alive\r\n\r\n"};
const uint8_t index_htm[] = {0x3c,0x68,0x74,0x6d,0x6c,0x3e,0x3c,0x62,0x6f,0x64,0x79,0x3e,0x3c,0x68,0x31,0x20,
0x73,0x74,0x79,0x6c,0x65,0x3d,0x22,0x74,0x65,0x78,0x74,0x2d,0x61,0x6c,0x69,0x67,
0x6e,0x3a,0x20,0x63,0x65,0x6e,0x74,0x65,0x72,0x3b,0x22,0x3e,0x53,0x54,0x4d,0x33,
0x32,0x46,0x31,0x30,0x33,0x78,0x38,0x3c,0x62,0x72,0x3e,0x3c,0x62,0x72,0x3e,0x57,
0x45,0x42,0x20,0x53,0x65,0x72,0x76,0x65,0x72,0x3c,0x2f,0x68,0x31,0x3e,0x0a,0x3c,
0x70,0x3e,0x3c,0x2f,0x70,0x3e,0x0a,0x3c,0x68,0x32,0x3e,0x46,0x65,0x61,0x74,0x75,
0x72,0x65,0x73,0x3c,0x2f,0x68,0x32,0x3e,0x0a,0x3c,0x70,0x3e,0x41,0x52,0x4d,0xc2,
0xae,0x20,0x33,0x32,0x2d,0x62,0x69,0x74,0x20,0x43,0x6f,0x72,0x74,0x65,0x78,0xc2,
0xae,0x2d,0x4d,0x33,0x20,0x43,0x50,0x55,0x20,0x43,0x6f,0x72,0x65,0x3c,0x2f,0x70,
0x3e,0x0a,0x3c,0x2f,0x62,0x6f,0x64,0x79,0x3e,0x3c,0x2f,0x68,0x74,0x6d,0x6c,0x3e};


void net_init(void)
{
	frame.data = NULL;
	frame.data_len = 0;
	
	ip_dst_str.buf_len = 0;
	ip_dst_str.ip_rec = 0;
	
	tcp_pckt_prop.tcp_stat = TCP_DISCONNECTED;
	
	cur_index = 0;
	clk_s = 0;
	uart_transmit((uint8_t *)"Start\r\n", 7);
}

void ip_str2num(char *ip_str, uint8_t *ip_num)
{
	uint8_t i, prt_len;
	char prt_str[5];
	char *dot_ptr, *sc_ptr;
	
	for(i = 0; i < 3; i++)
	{
		dot_ptr = strchr(ip_str, '.');
		
		prt_len = dot_ptr - ip_str+1;
		strncpy(prt_str, ip_str, prt_len);
		prt_str[prt_len] = 0;
		ip_num[i] = atoi(prt_str);
		ip_str = dot_ptr+1;
		
	}
	
	sc_ptr = strchr(ip_str, ':');
	if(sc_ptr)
	{
		prt_len = sc_ptr - ip_str+1;
		strncpy(prt_str, ip_str, prt_len);
		prt_str[prt_len] = 0;
		ip_num[i] = atoi(prt_str);
	}
	else
		ip_num[i] = atoi(ip_str);
	

}


uint16_t port_str2num(char *ip_str)
{
	uint16_t port;
	char *dot_ptr;
	
	dot_ptr = strchr(ip_str, ':');
	port = atoi(dot_ptr + 1);

	return port;
}

uint16_t ip_ch_sum_calc(uint8_t *head, uint16_t len, uint8_t type)
{
	
	uint32_t sum = 0;
	
	if(type == UDP_CH_SUM)
	{
		sum += IP_UDP;
		sum += len - 8;
	}
	else if(type == TCP_CH_SUM)
	{
		sum += IP_TCP;
		sum += len - 8;
	}
	
	while(len > 1)
	{
		sum += (uint16_t)(((uint16_t)*head << 8) | ((uint16_t)*(head+1)));
		len -=2;
		head += 2;
	}
	
	if(len)
		sum += (uint16_t)(((uint16_t)*head << 8) | ((uint16_t)0x00));
	
	while(sum & 0xFFFF0000)
		sum = ((sum >> 16) & 0x0000FFFF) + (sum & 0x0000FFFF);
	
	return ~be16toword(sum);
}

void eth_reply(enc28_frame *frame_repl, uint16_t dat_len)
{
	memcpy(frame_repl->hdr.dest_addr,   frame_repl->hdr.src_addr, 6);
	memcpy(frame_repl->hdr.src_addr,   frame_repl->hdr.dest_addr, 6);	
	frame_repl->data_len = dat_len; 
	enc28_packet_transmit(frame_repl);
}

void eth_request(enc28_frame *frame_req, uint16_t prot_type, uint8_t *mac_dest, uint16_t dat_len)
{
	memcpy(frame_req->hdr.dest_addr,   mac_dest, 6);
	memcpy(frame_req->hdr.src_addr,   mac_addr, 6);
	frame_req->hdr.type = prot_type;
	frame_req->data_len = dat_len; 
	enc28_packet_transmit(frame_req);
}


void arp_reply(enc28_frame *frame_rec,  uint16_t arp_pckt_len)
{
	arp_pckt *arp_repl = (void*)frame_rec->data;
	arp_repl->req_type = ARP_REP;
	memcpy(arp_repl->mac_dest, arp_repl->mac_src, 6);
	memcpy(arp_repl->mac_src, mac_addr, 6);
	memcpy(arp_repl->ip_dest, arp_repl->ip_src, 4);
	memcpy(arp_repl->ip_src, ip_addr, 4);
	
	eth_reply(frame_rec, sizeof(arp_pckt));
	
}

uint8_t arp_request (uint8_t *ip_dst)
{
	enc28_frame frame_req;
	frame_req.data = (uint8_t*) malloc(sizeof(arp_pckt) * sizeof(uint8_t));
	arp_pckt *arp_req = (void *)frame_req.data;
	
	arp_req->net_type = ARP_ETH;
	arp_req->prot_type = ARP_IP;
	arp_req->mac_len = 6;
	arp_req->ip_len = 4;
	arp_req->req_type = ARP_REQ;
	memcpy(arp_req->ip_src, ip_addr, 4);
	memcpy(arp_req->mac_src, mac_addr, 6);
	memcpy(arp_req->mac_dest, mac_addr_null, 6);
	memcpy(arp_req->ip_dest, ip_dst, 4);
	
	eth_request(&frame_req, ARP_TYPE, mac_addr_bc, sizeof(arp_pckt));
	free(frame_req.data);
	
	return 1;
}


void fill_arp_table(arp_record *arp_tbl_ptr, uint8_t *cur_len, uint8_t arp_tbl_len, uint32_t clk, enc28_frame *frame_rec)
{
	uint8_t i;
	arp_pckt *arp_repl = (arp_pckt *)frame_rec->data;
	
	if (*cur_len >= arp_tbl_len)
		*cur_len = arp_tbl_len - 1;
	for(i = 0; i < *cur_len; i++)
		if(!memcmp(arp_tbl_ptr[i].ip_addr, arp_repl->ip_src, 4))
			break;
	if(i == *cur_len)
	{		
		memcpy(arp_tbl_ptr[*cur_len].mac_addr, arp_repl->mac_src, 6);
		memcpy(arp_tbl_ptr[*cur_len].ip_addr, arp_repl->ip_src, 4);
		arp_tbl_ptr[*cur_len].clk = clk;
		(*cur_len)++;
	}
	for(i = 0; i < *cur_len; i++)
	{
		if((clk_s - arp_tbl_ptr[i].clk) > CLK_TIM_OUT)
			dlt_arp_table_record(arp_tbl_ptr, i, cur_len);
		
	}
}

int8_t find_arp_table_data(arp_record *arp_tbl_ptr, uint8_t cur_len, uint8_t *ip_num)
{
	int8_t i;
	
	for(i = 0; i < cur_len; i++)
		if(!memcmp(arp_tbl_ptr->ip_addr, ip_num, 4))
			break;
		
	if(i == cur_len)
		i = -1;
	
	return i;
	
}

void show_arp_table(arp_record *arp_tbl_ptr, uint8_t cur_len)
{
	uint8_t i;
	char s1[STR_LEN];
	
	uart_transmit((uint8_t *)"\r\n", 2);
	sprintf(s1,"ARP Table\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	for(i = 0; i < cur_len; i++)
	{
		sprintf(s1,"%d: mac_address: %02X:%02X:%02X:%02X:%02X:%02X - source_address: %d:%d:%d:%d, time: %d\r\n", i+1, arp_tbl_ptr[i].mac_addr[0],\
		arp_tbl_ptr[i].mac_addr[1], arp_tbl_ptr[i].mac_addr[2], arp_tbl_ptr[i].mac_addr[3], arp_tbl_ptr[i].mac_addr[4], arp_tbl_ptr[i].mac_addr[5],\
		arp_tbl_ptr[i].ip_addr[0], arp_tbl_ptr[i].ip_addr[1], arp_tbl_ptr[i].ip_addr[2], arp_tbl_ptr[i].ip_addr[3], arp_tbl_ptr[i].clk);
		uart_transmit((uint8_t *)s1, strlen(s1));
				
