AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 HTTP/User/Sources/net.c
}


uint8_t udp_read(enc28_frame *frame_rec, uint16_t udp_pckt_len)
{
	uint8_t res = 0;
	char s1[STR_LEN];
	ip_pckt ip_msg;
	udp_pckt udp_msg;
	
  ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	udp_msg.hdr = (void *)ip_msg.data;
	udp_msg.data = ip_msg.data + sizeof(udp_header);
	udp_msg.data_len = udp_pckt_len - sizeof(udp_header);

	
	sprintf(s1,"udp request\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	sprintf(s1,"udp source port: %u \r\n", be16toword(udp_msg.hdr->src_prt));
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	sprintf(s1,"udp dest port: %u \r\n", be16toword(udp_msg.hdr->dst_prt));
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	sprintf(s1,"udp check_sum: %04X\r\n", udp_msg.hdr->ch_sum);
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	udp_msg.hdr->ch_sum = 0;
	udp_msg.hdr->ch_sum = ip_ch_sum_calc(((uint8_t *)udp_msg.hdr)-8, udp_pckt_len + 8, UDP_CH_SUM);
	
	sprintf(s1,"udp check_sum calc: %04X\r\n", udp_msg.hdr->ch_sum);
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	strncpy(s1, (const char *)udp_msg.data, udp_msg.data_len);
	s1[udp_msg.data_len] = 0;
	uart_transmit((uint8_t *)s1, strlen(s1));
	uart_transmit((uint8_t *)"\r\n", 2);
	
	res = 1;
	
	return res;
}

void udp_reply(enc28_frame *frame_rec)
{
	enc28_frame frame_repl;
	ip_pckt ip_msg;
	udp_pckt udp_repl;
	uint16_t port;
	char s1[STR_LEN];
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	udp_repl.hdr = (void *)ip_msg.data;
	
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
	
	sprintf(s1,"Hello from UDP-Server to UDP-Client!!!\r\n");
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(udp_header) + strlen(s1)) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)udp_repl.hdr, sizeof(udp_header));
	memcpy(frame_repl.data + sizeof(ip_header) + sizeof(udp_header), (void*)s1, strlen(s1));
	
	udp_repl.hdr = (void *)(frame_repl.data + sizeof(ip_header));
	udp_repl.data = frame_repl.data + sizeof(ip_header) + sizeof(udp_header);
	udp_repl.data_len = strlen(s1);
	
	port = udp_repl.hdr->dst_prt;
	udp_repl.hdr->dst_prt = udp_repl.hdr->src_prt;
	udp_repl.hdr->src_prt = port;
	udp_repl.hdr->pck_len = be16toword(udp_repl.data_len + sizeof(udp_header));
	udp_repl.hdr->ch_sum = 0;
	udp_repl.hdr->ch_sum = ip_ch_sum_calc(frame_repl.data + sizeof(ip_header) - 8, udp_repl.data_len + sizeof(udp_header) + 8, UDP_CH_SUM);
	
	ip_reply(&frame_repl, udp_repl.data_len + sizeof(udp_header));
	
	free(frame_repl.data);
}

void udp_request(uint8_t *mac_dest, uint8_t *ip_dest, uint16_t port_dest, uint8_t *data, uint16_t dat_len)
{
	udp_pckt udp_req;
	enc28_frame frame_req;
	
	frame_req.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(udp_header) + dat_len) * sizeof(uint8_t));
	
	udp_req.data_len = dat_len;
	udp_req.data = frame_req.data + sizeof(ip_header) + sizeof(udp_header);
	udp_req.hdr = (void*)(udp_req.data - sizeof(udp_header));
	
	memcpy((void*)(udp_req.data - sizeof(udp_header) - 8), ip_addr, 4);
	memcpy((void*)(udp_req.data - sizeof(udp_header) - 4), ip_dest, 4);
	memcpy(udp_req.data, data, dat_len);
	
	udp_req.hdr->dst_prt = be16toword(port_dest);
	udp_req.hdr->src_prt = be16toword(UDP_PORT_SRC);
	udp_req.hdr->pck_len = be16toword(udp_req.data_len + sizeof(udp_header));
	udp_req.hdr->ch_sum = 0;
	udp_req.hdr->ch_sum = ip_ch_sum_calc((void*)(udp_req.data - sizeof(udp_header)-8), udp_req.data_len + sizeof(udp_header) + 8, UDP_CH_SUM);
	
	
	ip_request(&frame_req, IP_UDP, mac_dest, ip_dest, udp_req.data_len + sizeof(udp_header));
	
	free(frame_req.data);
}

uint8_t tcp_read(enc28_frame *frame_rec, uint16_t tcp_pckt_len)
{
	uint8_t res = 0;
	uint16_t i;
	char s1[STR_LEN];
	ip_pckt ip_msg;
	tcp_pckt tcp_msg;
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	tcp_msg.hdr = (void *)ip_msg.data;
	tcp_msg.data = ip_msg.data + sizeof(tcp_header);
	tcp_msg.data_len = tcp_pckt_len - sizeof(tcp_header);
	
	sprintf(s1,"TCP request\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	if(tcp_msg.hdr->flgs == (TCP_PSH | TCP_ACK))
	{
		if(tcp_msg.data_len)
		{
			for(i = 0; i < tcp_msg.data_len; i++)
				uart_transmit((uint8_t *)&tcp_msg.data[i], 1);
			uart_transmit((uint8_t *)"\r\n", 2);
			
			if(strncmp((char *)tcp_msg.data, "GET / ", 6) == 0)
			{
				tcp_pckt_prop.data_size = strlen(http_header) + sizeof(index_htm);
				tcp_pckt_prop.data_cnt = tcp_pckt_prop.data_size/TCP_SEG_LEN + 1;
				tcp_pckt_prop.last_data_size = tcp_pckt_prop.data_size % TCP_SEG_LEN;
				
				if(tcp_pckt_prop.data_cnt == 1)
				{
					tcp_pckt_prop.data_stat = TCP_DATA_ONE;
					
				}
				else if(tcp_pckt_prop.data_cnt > 1)
				{
					tcp_pckt_prop.data_stat = TCP_DATA_FIRST;
				}
				
				if(tcp_pckt_prop.data_stat == TCP_DATA_ONE)
					tcp_http_data_send_one(frame_rec, &tcp_pckt_prop, tcp_pckt_len);
				
			}
			else
				tcp_reply(frame_rec, TCP_OP_ACK_OF_DATA, tcp_pckt_len);
		}
		else
			tcp_reply(frame_rec, TCP_OP_ACK_OF_FIN, tcp_pckt_len);
	}
	
	else if(tcp_msg.hdr->flgs == TCP_SYN)
	{
		tcp_reply(frame_rec, TCP_OP_SYNACK, tcp_pckt_len);
	}
	else if (tcp_msg.hdr->flgs == TCP_ACK)
	{
		sprintf(s1,"ACK received\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		if(tcp_pckt_prop.data_stat == TCP_DATA_END)
			tcp_http_data_end(frame_rec, &tcp_pckt_prop);
			
	}
	else if (tcp_msg.hdr->flgs == (TCP_FIN | TCP_ACK))
	{
		tcp_reply(frame_rec, TCP_OP_ACK_OF_FIN, tcp_pckt_len);
	}
	res = 1;
	
	return res;
	
}

void tcp_header_prepare(tcp_pckt *tcp_repl, tcp_prop *tcp_prop, uint8_t flgs, uint16_t tcp_header_len, uint16_t tcp_data_len)
{
	tcp_repl->hdr->dst_prt = be16toword(tcp_prop->dst_port);
	tcp_repl->hdr->src_prt = be16toword(TCP_PORT_SRC);
	tcp_repl->hdr->sn = be32todword(tcp_prop->sn);
	tcp_repl->hdr->ack_sn = be32todword(tcp_prop->ack_sn);
	tcp_repl->hdr->flgs = flgs;
	tcp_repl->hdr->hdr_len = (uint8_t)(tcp_header_len << 2);
	tcp_repl->hdr->win_size = be16toword(TCP_WIN_LEN);
	tcp_repl->hdr->urg_ptr = 0;
	tcp_repl->hdr->ch_sum = 0;
	tcp_repl->hdr->ch_sum = ip_ch_sum_calc((uint8_t*)tcp_repl->hdr - 8, tcp_data_len + tcp_header_len + 8, TCP_CH_SUM);
	
