AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 HTTP/User/Sources/net.c
}


void tcp_reply(enc28_frame *frame_rec, uint8_t op_type, uint16_t tcp_pckt_len)
{
	static uint8_t tcp_data_rec = 0;
	char s1[STR_LEN];
	enc28_frame frame_repl;
	ip_pckt ip_msg;
	tcp_pckt tcp_repl;
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	tcp_repl.hdr = (void *)ip_msg.data;
	
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
	
	tcp_repl.data_len = 0;
	tcp_repl.data = NULL;
	
	if(op_type == TCP_OP_SYNACK)
		tcp_repl.data_len = 4;
	
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
	tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
	
	if(op_type == TCP_OP_SYNACK)
	{
		tcp_pckt_prop.ack_sn = be32todword(tcp_repl.hdr->sn)+1;
		tcp_pckt_prop.sn = 1;
		tcp_pckt_prop.dst_port =  be16toword(tcp_repl.hdr->src_prt);
		
		tcp_repl.data = frame_repl.data + sizeof(ip_header) + sizeof(tcp_header);
		tcp_repl.data[0] = 2;
		tcp_repl.data[1] = 4;
		tcp_repl.data[2] = (uint8_t)(TCP_SEG_LEN >> 8);
		tcp_repl.data[3] = (uint8_t)TCP_SEG_LEN;
		

		tcp_header_prepare(&tcp_repl, &tcp_pckt_prop, (TCP_SYN | TCP_ACK), sizeof(tcp_header) + tcp_repl.data_len, 0);
	
		ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
		sprintf(s1,"SYN ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		tcp_pckt_prop.tcp_stat = TCP_CONNECTED;
		
	}
	else if(op_type == TCP_OP_ACK_OF_FIN)
	{
		tcp_pckt_prop.ack_sn = be32todword(tcp_repl.hdr->sn)+1;
		tcp_pckt_prop.sn = be32todword(tcp_repl.hdr->ack_sn);
		tcp_pckt_prop.dst_port =  be16toword(tcp_repl.hdr->src_prt);
		
		tcp_header_prepare(&tcp_repl, &tcp_pckt_prop, TCP_ACK, sizeof(tcp_header), tcp_repl.data_len);
		
		ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
		sprintf(s1,"ACK for FIN | ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		if(tcp_pckt_prop.tcp_stat != TCP_DISCONNECTED)
		{
			memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
			memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
			tcp_header_prepare(&tcp_repl, &tcp_pckt_prop, (TCP_FIN | TCP_ACK), sizeof(tcp_header), tcp_repl.data_len);
			ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
			
			sprintf(s1,"FIN ACK transmitted\r\n");
			uart_transmit((uint8_t *)s1, strlen(s1));
			
			tcp_pckt_prop.tcp_stat = TCP_DISCONNECTED;
		}
		
		free(frame_repl.data);
	}
	else if(op_type == TCP_OP_ACK_OF_DATA)
	{
		tcp_data_rec++;
		tcp_pckt_prop.ack_sn = be32todword(tcp_repl.hdr->sn) + tcp_pckt_len - sizeof(tcp_header);
		tcp_pckt_prop.sn = be32todword(tcp_repl.hdr->ack_sn);
		tcp_pckt_prop.dst_port =  be16toword(tcp_repl.hdr->src_prt);
		tcp_header_prepare(&tcp_repl, &tcp_pckt_prop, TCP_ACK, sizeof(tcp_header), tcp_repl.data_len);
	
		ip_reply(&frame_repl, sizeof(tcp_header));
		sprintf(s1,"DATA ACK transmitted\r\n");
		uart_transmit((uint8_t *)s1, strlen(s1));
		
		if(tcp_data_rec == 2)
		{
			tcp_data_rec = 0;
			free(frame_repl.data);
			
			sprintf(s1,"Hello from TCP Server to TCP Client\r\n");
			tcp_repl.data_len = strlen(s1);
			
			tcp_repl.hdr = (void *)ip_msg.data;
			memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header)); 
			
			frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
			memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
			memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
			memcpy(frame_repl.data + sizeof(ip_header) + sizeof(tcp_header), (void*)s1, tcp_repl.data_len);
			tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
			tcp_repl.data = frame_repl.data + sizeof(ip_header) +  sizeof(tcp_header);
			
			tcp_header_prepare(&tcp_repl, &tcp_pckt_prop, (TCP_PSH | TCP_ACK), sizeof(tcp_header), tcp_repl.data_len);
			ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
			
			sprintf(s1,"DATA transmitted\r\n");
			uart_transmit((uint8_t *)s1, strlen(s1));
	}
		
	}
	
	free(frame_repl.data);
	
}

void tcp_http_data_send_one(enc28_frame *frame_rec, tcp_prop *tcp_prop, uint16_t tcp_pckt_len)
{
	char s1[STR_LEN];

	enc28_frame frame_repl;
	ip_pckt ip_msg;
	tcp_pckt tcp_repl;
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	tcp_repl.hdr = (void *)ip_msg.data;
	tcp_repl.data_len = 0;
	
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header));
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
	tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
	
	tcp_prop->ack_sn = be32todword(tcp_repl.hdr->sn)+ tcp_pckt_len - sizeof(tcp_header);
	tcp_prop->sn = be32todword(tcp_repl.hdr->ack_sn);
	tcp_prop->dst_port =  be16toword(tcp_repl.hdr->src_prt);	
	tcp_header_prepare(&tcp_repl, tcp_prop, TCP_ACK, sizeof(tcp_header), tcp_repl.data_len);
	
	ip_reply(&frame_repl, sizeof(tcp_header));
	free(frame_repl.data);
	sprintf(s1,"HTTP Request ACK transmitted\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
		
	// Data transmission
	free(frame_rec->data + sizeof(ip_header) + sizeof(tcp_header));
	
	tcp_repl.data_len = strlen(http_header) + sizeof(index_htm);
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header));
	tcp_repl.hdr = (void *)ip_msg.data;	
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
	memcpy(frame_repl.data + sizeof(ip_header) + sizeof(tcp_header), (void*)http_header, strlen(http_header));
	memcpy(frame_repl.data + sizeof(ip_header) + sizeof(tcp_header) + strlen(http_header), (void*)index_htm, sizeof(index_htm));
	tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
	tcp_repl.data = frame_repl.data + sizeof(ip_header) +  sizeof(tcp_header);
		
