AlexeyStarovoitov/STM32F103C8T6/STM32F103 ENC28J60 HTTP/User/Sources/net.c
	tcp_header_prepare(&tcp_repl, tcp_prop, (TCP_PSH | TCP_ACK), sizeof(tcp_header), tcp_repl.data_len);
	tcp_prop->data_stat = TCP_DATA_END;
	
	ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
	free(frame_repl.data);
	sprintf(s1,"HTTP DATA transmitted\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	
	
	
}


void tcp_http_data_end(enc28_frame *frame_rec, tcp_prop *tcp_prop)
{
	char s1[STR_LEN];
	enc28_frame frame_repl;
	ip_pckt ip_msg;
	tcp_pckt tcp_repl;
	
	ip_msg.hdr = (void *)frame_rec->data;
	ip_msg.data = frame_rec->data + sizeof(ip_header);
	
	tcp_repl.hdr = (void *)ip_msg.data;
	tcp_repl.data_len = 0;
	
	memcpy((void *)&frame_repl.hdr, (void *)&(frame_rec->hdr), sizeof(enc28_frame_header));
	frame_repl.data = (uint8_t*) malloc((sizeof(ip_header) + sizeof(tcp_header) + tcp_repl.data_len) * sizeof(uint8_t));
	memcpy(frame_repl.data, (void*)ip_msg.hdr, sizeof(ip_header));
	memcpy(frame_repl.data + sizeof(ip_header), (void*)tcp_repl.hdr, sizeof(tcp_header));
	tcp_repl.hdr = (void*)(frame_repl.data + sizeof(ip_header));
	
	tcp_prop->ack_sn = be32todword(tcp_repl.hdr->sn);
	tcp_prop->sn = be32todword(tcp_repl.hdr->ack_sn);
	tcp_prop->dst_port =  be16toword(tcp_repl.hdr->src_prt);	
	
	tcp_header_prepare(&tcp_repl, tcp_prop, (TCP_FIN | TCP_ACK), sizeof(tcp_header), tcp_repl.data_len);
	
	ip_reply(&frame_repl, tcp_repl.data_len + sizeof(tcp_header));
	free(frame_repl.data);
	
	sprintf(s1,"HTTP FIN ACK transmitted\r\n");
	uart_transmit((uint8_t *)s1, strlen(s1));
	
	tcp_prop->data_stat = TCP_DATA_COMPLETED;
	tcp_prop->tcp_stat = TCP_DISCONNECTED;
	
	
	
	
	
}

